HaiQNguyen/Oryx_608_Porting/SAME54_Oryx_ATECC608/main.c
#include <atmel_start.h>

#include "same54.h"
#include "same54_xplained_pro.h"
#include "core/net.h"
#include "drivers/mac/same54_eth_driver.h"
#include "drivers/phy/ksz8091_driver.h"
#include "dhcp/dhcp_client.h"
#include "ipv6/slaac.h"
#include "mqtt/mqtt_client.h"
#include "hardware/same54_crypto.h"
#include "rng/yarrow.h"
#include "debug.h"

#include "cryptoauthlib.h"
#include "atca_host.h"
#include "tng_atca.h"
#include "tng_atcacert_client.h"
#include "atcacert_pem.h"
#include "atcacert\atcacert_host_hw.h"
#include "tngtn_cert_def_1_signer.h"
#include "tngtn_cert_def_2_device.h"
#include "lib\tls\atcatls.h"
#include "lib\tls\atcatls_cfg.h"


/* Define section ---------------------------------------------------*/


//Ethernet interface configuration
#define APP_IF_NAME "eth0"
#define APP_HOST_NAME "mqtt-client-demo"
#define APP_MAC_ADDR "00-AB-CD-EF-54-20"

#define APP_USE_DHCP_CLIENT ENABLED
#define APP_IPV4_HOST_ADDR "192.168.0.20"
#define APP_IPV4_SUBNET_MASK "255.255.255.0"
#define APP_IPV4_DEFAULT_GATEWAY "192.168.0.254"
#define APP_IPV4_PRIMARY_DNS "8.8.8.8"
#define APP_IPV4_SECONDARY_DNS "8.8.4.4"

#define APP_USE_SLAAC ENABLED
#define APP_IPV6_LINK_LOCAL_ADDR "fe80::5420"
#define APP_IPV6_PREFIX "2001:db8::"
#define APP_IPV6_PREFIX_LENGTH 64
#define APP_IPV6_GLOBAL_ADDR "2001:db8::5420"
#define APP_IPV6_ROUTER "fe80::1"
#define APP_IPV6_PRIMARY_DNS "2001:4860:4860::8888"
#define APP_IPV6_SECONDARY_DNS "2001:4860:4860::8844"


/* Define section ---------------------------------------------------*/
#define CHECK_STATUS(s)										\
if(s != ATCA_SUCCESS) {										\
	printf("status code: 0x%x\r\n", s);						\
	printf("Error: Line %d in %s\r\n", __LINE__, __FILE__); \
	while(1);												\
}



//MQTT server name
//#define APP_SERVER_NAME "iot.eclipse.org"
//#define APP_SERVER_NAME "test.mosquitto.org"
#define APP_SERVER_NAME "a17ku50coq7dzl-ats.iot.eu-central-1.amazonaws.com"

//MQTT server port
//#define APP_SERVER_PORT 1883   //MQTT over TCP
#define APP_SERVER_PORT 8883 //MQTT over TLS
//#define APP_SERVER_PORT 8884 //MQTT over TLS Mosquitto
//#define APP_SERVER_PORT 80   //MQTT over WebSocket
//#define APP_SERVER_PORT 443  //MQTT over secure WebSocket

//URI (for MQTT over WebSocket only)
#define APP_SERVER_URI "a17ku50coq7dzl-ats.iot.eu-central-1.amazonaws.com"


/* Local variable section --------------------------------------------*/
ATCAIfaceCfg cfg_ateccx08a_i2c_device = {
	.iface_type				= ATCA_I2C_IFACE,
	.devtype				= ATECC608A,
	.atcai2c.slave_address	= 0x6A,
	.atcai2c.bus			= 1,
	.atcai2c.baud			= 400000,
	.wake_delay				= 800,
	.rx_retries				= 20,
	.cfg_data              = &I2C_0
};

volatile ATCA_STATUS status;
tng_type_t t = TNGTYPE_22;
uint8_t serial_number[ATCA_SERIAL_NUM_SIZE];
//Certificate chain
char_t certChain[2500];
//char_t certChain[] =
//"-----BEGIN CERTIFICATE-----"
//"MIIB9DCCAZugAwIBAgIQcK2Tvu8XByvn9asGTKZzmzAKBggqhkjOPQQDAjBPMSEw"
//"HwYDVQQKDBhNaWNyb2NoaXAgVGVjaG5vbG9neSBJbmMxKjAoBgNVBAMMIUNyeXB0"
//"byBBdXRoZW50aWNhdGlvbiBTaWduZXIgRjYwMDAgFw0xOTAzMjkxODAwMDBaGA8y"
//"MDQ3MDMyOTE4MDAwMFowRjEhMB8GA1UECgwYTWljcm9jaGlwIFRlY2hub2xvZ3kg"
//"SW5jMSEwHwYDVQQDDBgwMTIzNjFGRDVFQkRBQTA2MDEgQVRFQ0MwWTATBgcqhkjO"
//"PQIBBggqhkjOPQMBBwNCAATiV6oZwekAtQZQnCx1xaGn/+Jh27gYWYswIZ6rY8IF"
//"Iak0kAkTO70Nsq3slDmuKogg0qqhVRWPKXLvXUtZyq/Uo2AwXjAMBgNVHRMBAf8E"
//"AjAAMA4GA1UdDwEB/wQEAwIDiDAdBgNVHQ4EFgQUfA4Vdk/biF8UnjdMhFKFv+ic"
//"m1swHwYDVR0jBBgwFoAU+9yqEor6wbWSj82rEdsJPs9NvvYwCgYIKoZIzj0EAwID"
//"RwAwRAIgLKMCu07Zh48KQEILHgcPPR6PE/PNiNzLAjei3nleUJ8CIAqGhGdsDmC7"
//"qJIgF+XsQBgr67OV0+zCMVTrUyd5pCqr"
//"-----END CERTIFICATE-----"
//"-----BEGIN CERTIFICATE-----"
//"MIICBTCCAaqgAwIBAgIQeQqn1X1z3OltZdtmi3ayXjAKBggqhkjOPQQDAjBPMSEw"
//"HwYDVQQKDBhNaWNyb2NoaXAgVGVjaG5vbG9neSBJbmMxKjAoBgNVBAMMIUNyeXB0"
//"byBBdXRoZW50aWNhdGlvbiBSb290IENBIDAwMjAgFw0xODEyMTQxOTAwMDBaGA8y"
//"MDQ5MTIxNDE5MDAwMFowTzEhMB8GA1UECgwYTWljcm9jaGlwIFRlY2hub2xvZ3kg"
//"SW5jMSowKAYDVQQDDCFDcnlwdG8gQXV0aGVudGljYXRpb24gU2lnbmVyIEY2MDAw"
//"WTATBgcqhkjOPQIBBggqhkjOPQMBBwNCAAR2R0FwsmPnmVS8hbsS6f5wDFuN1NaT"
//"RZjCKadoAg5OC21IddDtoe72X5FfxrEWRsWhymMfYlVodEdpxd6DtYlqo2YwZDAO"
//"BgNVHQ8BAf8EBAMCAYYwEgYDVR0TAQH/BAgwBgEB/wIBADAdBgNVHQ4EFgQU+9yq"
//"Eor6wbWSj82rEdsJPs9NvvYwHwYDVR0jBBgwFoAUeu19bca3eJ2yOAGl6EqMsKQO"
//"KowwCgYIKoZIzj0EAwIDSQAwRgIhAMYwMempizBOaH4GxTl5KsV6XAFNMBfe3NJ9"
//"1R3Nhjf/AiEAxqIsbrGuX4WRSctd53eLo/ML6T2bgG+Uvz2QpYR4Ydw="
//"-----END CERTIFICATE-----"
//"-----BEGIN CERTIFICATE-----"
//"MIIB8TCCAZegAwIBAgIQd9NtlW7IrmIF5Y46y5hagTAKBggqhkjOPQQDAjBPMSEw"
//"HwYDVQQKDBhNaWNyb2NoaXAgVGVjaG5vbG9neSBJbmMxKjAoBgNVBAMMIUNyeXB0"
//"byBBdXRoZW50aWNhdGlvbiBSb290IENBIDAwMjAgFw0xODExMDgxOTEyMTlaGA8y"
//"MDU4MTEwODE5MTIxOVowTzEhMB8GA1UECgwYTWljcm9jaGlwIFRlY2hub2xvZ3kg"
//"SW5jMSowKAYDVQQDDCFDcnlwdG8gQXV0aGVudGljYXRpb24gUm9vdCBDQSAwMDIw"
//"WTATBgcqhkjOPQIBBggqhkjOPQMBBwNCAAS9VOZt44dUhABrU64VgNUKoGnnit9V"
//"eNhc4tVN1bgwKWv/3W5vclb72Z7xoRaxHTOtSRA6oYWHOdz65DfhnWNOo1MwUTAd"
//"BgNVHQ4EFgQUeu19bca3eJ2yOAGl6EqMsKQOKowwHwYDVR0jBBgwFoAUeu19bca3"
//"eJ2yOAGl6EqMsKQOKowwDwYDVR0TAQH/BAUwAwEB/zAKBggqhkjOPQQDAgNIADBF"
//"AiEAodxjRZDsgZ7h3luBEmVRrdTCxPjllSgu4EvnaOx8AnMCID5rp06eTArWjCSw"
//"+y7nk9LmvpRlyhXQ6lvIf1V5mVyt"
//"-----END CERTIFICATE-----";

//List of trusted CA certificates
char_t trustedCaList[] =
"-----BEGIN CERTIFICATE-----"
"MIIBtjCCAVugAwIBAgITBmyf1XSXNmY/Owua2eiedgPySjAKBggqhkjOPQQDAjA5"
"MQswCQYDVQQGEwJVUzEPMA0GA1UEChMGQW1hem9uMRkwFwYDVQQDExBBbWF6b24g"
"Um9vdCBDQSAzMB4XDTE1MDUyNjAwMDAwMFoXDTQwMDUyNjAwMDAwMFowOTELMAkG"
"A1UEBhMCVVMxDzANBgNVBAoTBkFtYXpvbjEZMBcGA1UEAxMQQW1hem9uIFJvb3Qg"
"Q0EgMzBZMBMGByqGSM49AgEGCCqGSM49AwEHA0IABCmXp8ZBf8ANm+gBG1bG8lKl"
"ui2yEujSLtf6ycXYqm0fc4E7O5hrOXwzpcVOho6AF2hiRVd9RFgdszflZwjrZt6j"
"QjBAMA8GA1UdEwEB/wQFMAMBAf8wDgYDVR0PAQH/BAQDAgGGMB0GA1UdDgQWBBSr"
"ttvXBp43rDCGB5Fwx5zEGbF4wDAKBggqhkjOPQQDAgNJADBGAiEA4IWSoxe3jfkr"
"BqWTrBqYaGFy+uGh0PsceGCmQ5nFuMQCIQCcAu/xlJyzlvnrxir4tiz+OpAUFteM"
"YyRIHN8wfdVoOw=="
"-----END CERTIFICATE-----"
"-----BEGIN CERTIFICATE-----"
"MIIDWTCCAkGgAwIBAgIURerfVjTlvzXETh50AR3QQOcLgUQwDQYJKoZIhvcNAQEL"
"BQAwTTFLMEkGA1UECwxCQW1hem9uIFdlYiBTZXJ2aWNlcyBPPUFtYXpvbi5jb20g"
"SW5jLiBMPVNlYXR0bGUgU1Q9V2FzaGluZ3RvbiBDPVVTMB4XDTE5MDczMTEwMjI0"
"N1oXDTQ5MTIzMTIzNTk1OVowHjEcMBoGA1UEAwwTQVdTIElvVCBDZXJ0aWZpY2F0"
"ZTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAPKOCHdKd1xmybp3ol5L"
"5AGp5HEe56ZXi32fnLMG3aCTZpLzTcCh5/g9v1O3LJVxABiVr1qZiMqrnnFQBK81"
"3dFIF3Y4yiY/cjyG/h++F30rWCGAS5zwhiFUrVIdccL36LaqD6qPcH2Ew91W0lVm"
"g9xSLfgPPFQPcPTIxzozAf9cU4B2710N++1xa9XiqXicP0u3nAaJ3FuikVJTKgs/"
"IthGo9ke4Fm2sXzrRV1+MH8olI+7QYFZWAibJf4ANKxhEUADHQNUY1zRjTpF3gZZ"
"3gpL+Jg67IaHgFQvrU7GKjoNDG3xRKcNAC03jbhJx3cfypI1BGmD7iRCtPVRRrFf"
"NpkCAwEAAaNgMF4wHwYDVR0jBBgwFoAULuKaVts5pDiqD6G1zkPIw9CtVGUwHQYD"
"VR0OBBYEFHzuELHXCG5ZgPUSdd/bcmZPpiEGMAwGA1UdEwEB/wQCMAAwDgYDVR0P"
"AQH/BAQDAgeAMA0GCSqGSIb3DQEBCwUAA4IBAQAnHPbO/eOhEejYMFDPtbYdhYFP"
"c49rAaMMEyfM6RmlqKCDdEJGJL2wrJAYEyVr5v7ysfdjtmsXkDNwUgx2Hxx+p9m4"
"4wNlaU8BWheqx64ybeFWn4fijKYbboRobmASjS/vrAeaAn9IcKv2T8xv2Gd85vBn"
"bf7mVQ2PmYh1HpVPjoLcJFxr/8rbLorvM0eKYpzAiqyCgqtuFksDs6zy5Aqw9CBM"
"yZ37XFbca8+uawhBv29ayryTN3cdUkskvD8AqAT/85jDjD2Py4tjufJJnkL4Smml"
"ipgzX6XTXOebh1KV30azuGptNkNUAinPSyNznECPW5fWzLQXpsW/FHPQHZGD"
"-----END CERTIFICATE-----";

//Global variables
DhcpClientSettings dhcpClientSettings;
DhcpClientContext dhcpClientContext;
SlaacSettings slaacSettings;
SlaacContext slaacContext;
MqttClientContext mqttClientContext;
YarrowContext yarrowContext;
MdnsResponderSettings mdnsResponderSettings;
MdnsResponderContext mdnsResponderContext;

uint8_t seed[32];



