HaiQNguyen/Oryx_608_Porting/SAME54_Oryx_ATECC608/main.c
/* Local function prototype section ----------------------------------*/
void print_bytes(uint8_t * ptr, uint16_t length);
error_t ecc508aEcdhCallback(TlsContext *context);

error_t ecc508aEcdsaSignCallback(TlsContext *context,
									const uint8_t *digest, size_t digestLength, EcdsaSignature *signature);

error_t ecc508aEcdsaVerifyCallback(TlsContext *context,
									const uint8_t *digest, size_t digestLength, EcdsaSignature *signature);

/**
 * @brief I/O initialization
 **/

void ioInit(void)
{
   //Enable PORT bus clock (CLK_PORT_APB)
   MCLK->APBBMASK.bit.PORT_ = 1;

   //Configure LED0
   PORT->Group[LED0_GROUP].DIRSET.reg = LED0_MASK;
   PORT->Group[LED0_GROUP].OUTSET.reg = LED0_MASK;

   //Configure SW0 button
   PORT->Group[SW0_GROUP].DIRCLR.reg = SW0_MASK;
   PORT->Group[SW0_GROUP].PINCFG[SW0_PIN].bit.INEN = 1;
}

/**
 * @brief Certificate Store init
 **/

void certStoreInit(void)
{
	volatile ATCA_STATUS status;
	tng_type_t t = TNGTYPE_22;
	
	uint8_t devicePubkey[64], signerPubkey[64], rootPubkey[64];
	uint8_t cert[800], certsigner[800], certdevice[768];
	memset(cert, 0x00, sizeof(cert) );
	
	printf("CryptoAuthLib Basics Trust'N'GO MAH22 Certificate Auth\n\r");
	printf("--------Root Certificate Section---------\n");
	size_t cert_size;
	status = tng_atcacert_root_cert_size(&cert_size); CHECK_STATUS(status);
	status = tng_atcacert_root_cert(cert, &cert_size); CHECK_STATUS(status);
	status = tng_atcacert_root_public_key(rootPubkey); CHECK_STATUS(status);
	//printf("Cert [%d]\n", cert_size);
	//print_bytes(cert, cert_size);
	char cert_pem[1024]; size_t cert_size_pem = sizeof(cert_pem);
	status = atcacert_encode_pem_cert(cert, cert_size, cert_pem, &cert_size_pem); CHECK_STATUS(status)
	//printf("Cert PEM [%d]\n%s\n", strlen(cert_pem), cert_pem);
	
	//char rootPubkey_pem[176]; size_t rootPubkey_size_pem = sizeof(rootPubkey_pem);
	//status = atcacert_encode_pem_pubkey(rootPubkey, sizeof(rootPubkey), rootPubkey_pem, &rootPubkey_size_pem);
	//printf("Public key [%d]\n%s\n", strlen(rootPubkey_pem), rootPubkey_pem);
	//printf("Public key [%d]\n", sizeof(rootPubkey));
	//print_bytes(rootPubkey, sizeof(rootPubkey));
	
	//printf("TBS Digest\n");
	bool is_verified;
	
	uint8_t dig[32];
	uint8_t rootSignature[64];uint16_t dig_size;
	uint8_t offset = 432+2; //location of R
	memcpy(rootSignature, cert+offset, 32);//size of R
	offset = 467+2; //location of S
	memcpy(rootSignature+32, cert+offset, 32);//size of S
	status = atcab_sha(411, cert+4, NULL); CHECK_STATUS(status);
	status = atcab_verify_extern(dig, rootSignature, rootPubkey, &is_verified);
	//status = atcab_verify(VERIFY_MODE_EXTERNAL | VERIFY_MODE_SOURCE_TEMPKEY, NULL, rootSignature,rootPubkey, NULL, NULL);
	printf("--------Root validated: %s--------\n\n", (is_verified == TRUE)? "OK" : "FAILED");
	
	printf("--------Signer Certificate Section---------\n");
	size_t signer_size;
	status = tng_atcacert_max_signer_cert_size(&signer_size); CHECK_STATUS(status);
	status = tng_atcacert_read_signer_cert(certsigner, &signer_size); CHECK_STATUS(status);
	status = tng_atcacert_signer_public_key(signerPubkey, certsigner); CHECK_STATUS(status);
	char signer_pem[1024]; size_t signer_size_pem = sizeof(signer_pem);
	status = atcacert_encode_pem_cert(certsigner, signer_size, signer_pem, &signer_size_pem); CHECK_STATUS(status)
	//printf("Cert PEM [%d]\n%s\n", strlen(signer_pem), signer_pem);
	
	//printf("Public key [%d]\n", sizeof(signerPubkey));
	//print_bytes(signerPubkey, sizeof(signerPubkey));
	status = atcacert_verify_cert_hw(&g_tngtn_cert_def_1_signer, certsigner, signer_size, rootPubkey); CHECK_STATUS(status);
	printf("--------Signer validated: %s--------\n\n", (status == ATCA_SUCCESS)? "OK" : "FAILED");
	
	printf("--------Device Certificate Section---------\n");
	size_t device_size;
	status = tng_atcacert_max_device_cert_size(&device_size); CHECK_STATUS(status);
	status = tng_atcacert_read_device_cert(certdevice, &device_size, certsigner); CHECK_STATUS(status);
	status = tng_atcacert_device_public_key(devicePubkey, certdevice); CHECK_STATUS(status);
	char device_pem[1024]; size_t device_size_pem = sizeof(device_pem);
	status = atcacert_encode_pem_cert(certdevice, device_size, device_pem, &device_size_pem); CHECK_STATUS(status)
	//printf("Cert PEM [%d]\n%s\n", strlen(device_pem), device_pem);
	//printf("Public key [%d]\n", sizeof(devicePubkey));
	//print_bytes(devicePubkey, sizeof(devicePubkey));
	status = atcacert_verify_cert_hw(&g_tngtn_cert_def_2_device, certdevice, device_size, signerPubkey); CHECK_STATUS(status);
	printf("--------Device validated: %s--------\n\n", (status == ATCA_SUCCESS)? "OK" : "FAILED");   
	
	//TODO
	//memcpy(certChain, certsigner, signer_size);
	//memcpy(certChain+signer_size, certdevice, device_size);
	strcpy(certChain, device_pem);
	strcat(certChain, signer_pem);
	strcat(certChain, cert_pem);
	
	
	
	printf("Cert Chain PEM [%d]\n%s\n", strlen(certChain), certChain);
}
/**
 * @brief Random data generation callback function
 * @param[out] data Buffer where to store the random data
 * @param[in] length Number of bytes that are required
 * @return Error code
 **/

error_t webSocketRngCallback(uint8_t *data, size_t length)
{
   //Generate some random data
   return yarrowRead(&yarrowContext, data, length);
}

/**
 * @brief TLS initialization callback
 * @param[in] context Pointer to the MQTT client context
 * @param[in] tlsContext Pointer to the TLS context
 * @return Error code
 **/

error_t mqttTestTlsInitCallback(MqttClientContext *context,
   TlsContext *tlsContext)
{
   error_t error;
	//Debug message
	TRACE_INFO("MQTT: TLS initialization callback\r\n");

	//Set the PRNG algorithm to be used
	error = tlsSetPrng(tlsContext, YARROW_PRNG_ALGO, &yarrowContext);
	//Any error to report?
	if(error)
	return error;
	  
#if (TLS_ECC_CALLBACK_SUPPORT == 1)
	//Register ECDH key agreement callback function
	error = tlsSetEcdhCallback(tlsContext, ecc508aEcdhCallback);
	//Any error to report?
	if(error)
		return error;

	//Register ECDSA signature generation callback function
	error = tlsSetEcdsaSignCallback(tlsContext, ecc508aEcdsaSignCallback);
	//Any error to report?
	if(error)
		return error;

	//Register ECDSA signature verification callback function
	error = tlsSetEcdsaVerifyCallback(tlsContext, ecc508aEcdsaVerifyCallback);
	//Any error to report?
	if(error)
		return error;

	//Set the fully qualified domain name of the server
	error = tlsSetServerName(tlsContext, APP_SERVER_NAME);
	//Any error to report?
	if(error)
		return error;

	//Import the list of trusted CA certificates
	error = tlsSetTrustedCaList(tlsContext, trustedCaList, strlen(trustedCaList));
	//Any error to report?
	if(error)
		return error;

	//TODO
	//Import the client's certificate
	error = tlsAddCertificate(tlsContext, certChain, strlen(certChain), NULL, 0);
	//Any error to report?
	if(error){
		printf("Err: add certchain [%d]\n", error);
		return error;
	}
#else
	//Set the fully qualified domain name of the server
	error = tlsSetServerName(tlsContext, APP_SERVER_NAME);
	//Any error to report?
	if(error)
		return error;

	//Import the list of trusted CA certificates
	error = tlsSetTrustedCaList(tlsContext, trustedCaList, strlen(trustedCaList));
	//Any error to report?
	if(error)
		return error;
#endif

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Publish callback function
 * @param[in] context Pointer to the MQTT client context
 * @param[in] topic Topic name
 * @param[in] message Message payload
 * @param[in] length Length of the message payload
 * @param[in] dup Duplicate delivery of the PUBLISH packet
 * @param[in] qos QoS level used to publish the message
 * @param[in] retain This flag specifies if the message is to be retained
 * @param[in] packetId Packet identifier
 **/

void mqttTestPublishCallback(MqttClientContext *context,
   const char_t *topic, const uint8_t *message, size_t length,
   bool_t dup, MqttQosLevel qos, bool_t retain, uint16_t packetId)
{
   //Debug message
   TRACE_INFO("PUBLISH packet received...\r\n");
   TRACE_INFO("  Dup: %u\r\n", dup);
   TRACE_INFO("  QoS: %u\r\n", qos);
   TRACE_INFO("  Retain: %u\r\n", retain);
   TRACE_INFO("  Packet Identifier: %u\r\n", packetId);
   TRACE_INFO("  Topic: %s\r\n", topic);
   TRACE_INFO("  Message (%" PRIuSIZE " bytes):\r\n", length);
   TRACE_INFO_ARRAY("    ", message, length);

